{
  "_name_or_path": "/home/jgroen/NEU/dstl/transformer/outputs/",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 512,
  "decoder_intermediate_size": 2048,
  "decoder_num_attention_heads": 16,
  "decoder_num_hidden_layers": 8,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "ax_cropped_images",
    "1": "b_cropped_images",
    "2": "b_up_cropped_images",
    "3": "g_cropped_images",
    "4": "n_cropped_images"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ax_cropped_images": "0",
    "b_cropped_images": "1",
    "b_up_cropped_images": "2",
    "g_cropped_images": "3",
    "n_cropped_images": "4"
  },
  "layer_norm_eps": 1e-12,
  "mask_ratio": 0.75,
  "model_type": "vit",
  "norm_pix_loss": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.26.0.dev0"
}
